Revit 2027 API
OBJExportOptions.IsValidForSurfaceTolerance Method
 Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidForSurfaceTolerance(
	double value
)
Public Shared Function IsValidForSurfaceTolerance (
	value As Double
) As Boolean
public:
static bool IsValidForSurfaceTolerance(
	double value
)
static member IsValidForSurfaceTolerance :
        value : float -> bool
Parameters
value Double
 The value to be checked.
Return Value
Boolean
 True if the value is valid for SurfaceTolerance, false otherwise.
See Also
Reference
OBJExportOptions Class
Autodesk.Revit.DB Namespace